In [1]:
import sys

In [2]:
sys.version_info

sys.version_info(major=3, minor=7, micro=3, releaselevel='final', serial=0)

In [3]:
if sys.platform == 'darwin' :
    print(" Mac OS")
else :
    print(" Windows ")

 Mac OS

In [4]:
import pandas as pd

In [5]:
import numpy as np

# 1. stacking 과 unsticking

        인덱스의 정보가 멀티로 처리됨

In [12]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3),
                   columns=['a','b','c'])

In [13]:
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

### 열 칼럼의 정보를 행의 인덱스로 처리

      결과가 시리즈로 변경됨

In [15]:
s_st = df1.stack()

In [16]:
s_st

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
2  a    6
   b    7
   c    8
dtype: int64

In [17]:
s_st.index

MultiIndex(levels=[[0, 1, 2], ['a', 'b', 'c']],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1, 2]])

### 시리즈의 멀티인덱스가 사라지교 열 인덱스 정보로 변경됨

In [18]:
df_ust = s_st.unstack()

In [19]:
df_ust

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

# 2.  long-to-wide : pivot 처리

        피봇은 기존 테이블을 특정 인덱스와 열을 지정하고 그 내부의 값을 조정
        
        스택을 언스택하는 것은 맞지만 인덱스의 레벨을 추가하는 것이 아닌 실제 구조를 변경하는 것

In [42]:
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

## pivot

In [20]:
df_pt = df1.pivot(index="a", columns='b', values='c')

In [43]:
df_pt.shape

(3, 3)

In [21]:
df_pt

b    1    4    7
a
0  2.0  NaN  NaN
3  NaN  5.0  NaN
6  NaN  NaN  8.0

## pivot_table

In [24]:
df_ptt = df1.pivot_table(index="a", columns='b', values='c')

In [44]:
df_ptt.shape

(3, 3)

In [25]:
df_ptt

b    1    4    7
a
0  2.0  NaN  NaN
3  NaN  5.0  NaN
6  NaN  NaN  8.0

# 3. wide to long

            - 칼럼을 행의 인덱스로 변경할 때 사용
            - 열의 패턴을 구성할 때 이를 분리해서 처리 함

In [29]:
df = pd.DataFrame({"A1970" : {0 : "a", 1 : "b", 2 : "c"},
                          "A1980" : {0 : "d", 1 : "e", 2 : "f"},  
                          "B1970" : {0 : 2.5, 1 : 1.2, 2 : .7},
                          "B1980" : {0 : 3.2, 1 : 1.3, 2 : .1},
                           "X"     : dict(zip(range(3), np.random.randn(3)))
               })

In [30]:
df["id"] = df.index

In [31]:
df

  A1970 A1980  B1970  B1980         X  id
0     a     d    2.5    3.2 -0.777348   0
1     b     e    1.2    1.3 -0.129006   1
2     c     f    0.7    0.1 -0.199700   2

In [45]:
df.shape

(3, 6)

## wide_to_long 함수 사용하기

### 열의 이름이 분리될 경우  행의 인덱스를 조정하기

In [46]:
df_wtl = pd.wide_to_long(df,stubnames= ["A", "B"], i="id", j="year")

In [47]:
df_wtl.shape

(6, 3)

In [48]:
df_wtl

                X  A    B
id year
0  1970 -0.777348  a  2.5
1  1970 -0.129006  b  1.2
2  1970 -0.199700  c  0.7
0  1980 -0.777348  d  3.2
1  1980 -0.129006  e  1.3
2  1980 -0.199700  f  0.1

## melt 처리

       열을 행으로 변경해서 처리

In [34]:
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [38]:
df1.shape

(3, 3)

In [39]:
df_melt = pd.melt(df1, id_vars=['a'], value_vars=['b', 'c'])

In [40]:
df_melt.shape

(6, 3)

In [41]:
df_melt

   a variable  value
0  0        b      1
1  3        b      4
2  6        b      7
3  0        c      2
4  3        c      5
5  6        c      8